In [1]:
import numpy as np
import pandas as pd

In [2]:
my_dictionary = {"James" : [40,30,np.nan], "Kirk" : [20,np.nan,50], "Lars" : [30,40,60]}

In [3]:
my_data_frame = pd.DataFrame(my_dictionary)

In [4]:
my_data_frame

   James  Kirk  Lars
0   40.0  20.0    30
1   30.0   NaN    40
2    NaN  50.0    60

In [5]:
my_data_frame.dropna()

   James  Kirk  Lars
0   40.0  20.0    30

In [6]:
my_data_frame

   James  Kirk  Lars
0   40.0  20.0    30
1   30.0   NaN    40
2    NaN  50.0    60

In [7]:
my_data_frame.dropna(axis = 1)

   Lars
0    30
1    40
2    60

In [8]:
my_new_dictionary = {"James" : [40,30,np.nan], "Kirk" : [20,np.nan,50], "Lars" : [30,40,60], "Rob" : [45,np.nan,np.nan]}

In [9]:
my_new_data_frame = pd.DataFrame(my_new_dictionary)

In [10]:
my_new_data_frame

   James  Kirk  Lars   Rob
0   40.0  20.0    30  45.0
1   30.0   NaN    40   NaN
2    NaN  50.0    60   NaN

In [11]:
my_new_data_frame.dropna(axis=1, thresh=2)

   James  Kirk  Lars
0   40.0  20.0    30
1   30.0   NaN    40
2    NaN  50.0    60

In [12]:
my_new_data_frame

   James  Kirk  Lars   Rob
0   40.0  20.0    30  45.0
1   30.0   NaN    40   NaN
2    NaN  50.0    60   NaN

In [13]:
my_new_data_frame.fillna(20)

   James  Kirk  Lars   Rob
0   40.0  20.0    30  45.0
1   30.0  20.0    40  20.0
2   20.0  50.0    60  20.0

In [14]:
salary_dict = {"Programming Language" : ["Python","Python","Python","Java","Java","Swift"], "Name" : ["A","B","C","D","E","F"], "Salary" : [100,90,80,70,50,40]}

In [15]:
salary_frame = pd.DataFrame(salary_dict)

In [16]:
salary_frame

  Programming Language Name  Salary
0               Python    A     100
1               Python    B      90
2               Python    C      80
3                 Java    D      70
4                 Java    E      50
5                Swift    F      40

In [17]:
group_object = salary_frame.groupby("Programming Language")

In [18]:
group_object.count()

                      Name  Salary
Programming Language
Java                     2       2
Python                   3       3
Swift                    1       1

In [24]:
group_object.mean(numeric_only=True)

                      Salary
Programming Language
Java                    60.0
Python                  90.0
Swift                   40.0

In [25]:
group_object.min()

                     Name  Salary
Programming Language
Java                    D      50
Python                  A      80
Swift                   F      40

In [26]:
group_object.max()

                     Name  Salary
Programming Language
Java                    E      70
Python                  C     100
Swift                   F      40

In [27]:
group_object.min("Salary")

                      Salary
Programming Language
Java                      50
Python                    80
Swift                     40

In [28]:
group_object.max("Salary")

                      Salary
Programming Language
Java                      70
Python                   100
Swift                     40

In [31]:
group_object.min(numeric_only=True)

                      Salary
Programming Language
Java                      50
Python                    80
Swift                     40

In [32]:
group_object.describe()

                     Salary
                      count  mean        std   min   25%   50%   75%    max
Programming Language
Java                    2.0  60.0  14.142136  50.0  55.0  60.0  65.0   70.0
Python                  3.0  90.0  10.000000  80.0  85.0  90.0  95.0  100.0
Swift                   1.0  40.0        NaN  40.0  40.0  40.0  40.0   40.0

In [42]:
my_dict1 = {"Name" : ["A","B","C","D"],
            "Sports" : ["Basketball","Football","Tennis","Running"],
            "Calories" : [100,200,300,400]
           }

In [53]:
my_frame1 = pd.DataFrame(my_dict1, index=[0,1,2,3])

In [54]:
my_frame1

  Name      Sports  Calories
0    A  Basketball       100
1    B    Football       200
2    C      Tennis       300
3    D     Running       400

In [55]:
my_dict2 = {"Name" : ["E","F","G","H"],
            "Sports" : ["Basketball","Football","Tennis","Running"],
            "Calories" : [200,50,440,248]
           }

In [58]:
my_frame2 = pd.DataFrame(my_dict2, index=[4,5,6,7])

In [59]:
my_frame2

  Name      Sports  Calories
4    E  Basketball       200
5    F    Football        50
6    G      Tennis       440
7    H     Running       248

In [60]:
my_dict3 = {"Name" : ["I","J","K","L"],
            "Sports" : ["Basketball","Football","Tennis","Running"],
            "Calories" : [300,150,150,430]
           }

In [61]:
my_frame3 = pd.DataFrame(my_dict3, index=[8,9,10,11])

In [62]:
my_frame3

   Name      Sports  Calories
8     I  Basketball       300
9     J    Football       150
10    K      Tennis       150
11    L     Running       430

In [63]:
#concatenation

In [64]:
pd.concat([my_frame1,my_frame2,my_frame3])

   Name      Sports  Calories
0     A  Basketball       100
1     B    Football       200
2     C      Tennis       300
3     D     Running       400
4     E  Basketball       200
5     F    Football        50
6     G      Tennis       440
7     H     Running       248
8     I  Basketball       300
9     J    Football       150
10    K      Tennis       150
11    L     Running       430

In [65]:
#merge

In [66]:
my_frame1

  Name      Sports  Calories
0    A  Basketball       100
1    B    Football       200
2    C      Tennis       300
3    D     Running       400

In [67]:
my_frame2

  Name      Sports  Calories
4    E  Basketball       200
5    F    Football        50
6    G      Tennis       440
7    H     Running       248

In [68]:
pd.merge(my_frame1,my_frame2,on="Sports")

  Name_x      Sports  Calories_x Name_y  Calories_y
0      A  Basketball         100      E         200
1      B    Football         200      F          50
2      C      Tennis         300      G         440
3      D     Running         400      H         248

In [71]:
new_salary_frame = pd.DataFrame({"Name" : ["James","Kirk","Lars"], "Salary" : [10,20,30], "Age" : [60,65,70]})

In [72]:
new_salary_frame

    Name  Salary  Age
0  James      10   60
1   Kirk      20   65
2   Lars      30   70

In [76]:
new_salary_frame["Name"].unique()

array(['James', 'Kirk', 'Lars'], dtype=object)

In [77]:
new_salary_frame["Name"].nunique()

3

In [78]:
def grossToNet(salary):
    return salary * 0.65

In [79]:
new_salary_frame["Salary"].apply(grossToNet)

0     6.5
1    13.0
2    19.5
Name: Salary, dtype: float64